Autodesk.Revit.DB.ScheduleHeightsOnSheet.GetBodyRowHeights
Returns each row's height of schedule body on sheet view.
Returns:
Each row's height of schedule body on sheet view.
Since:
2022.1

Autodesk.Revit.DB.ScheduleHeightsOnSheet.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.ScheduleHeightsOnSheet.ColumnHeaderHeight
The height of all schedule header part, including the gap line between header and body.
Since:
2022.1

Autodesk.Revit.DB.ScheduleHeightsOnSheet.TitleHeight
The height of schedule title on sheet view.
Remarks:
If title is set to unshown, it will be 0.
Since:
2022.1

Autodesk.Revit.DB.ScheduleHeightsOnSheet
Heights information of a schedule on sheet.
Remarks:
This class returns the heights of schedule title, column header and each body row on sheet view.
Since:
2022.1